const textData = {
    calorieLackText:
        "사용자의 칼로리 섭취량이 적정 권장량 미만입니다. 신체의 에너지 요구 사항을 충족하고 전반적인 건강과 웰빙을 지원하기 위해 적절한 칼로리 섭취를 보장하는 것이 중요합니다. 권장량보다 지속적으로 적은 칼로리를 섭취하면 에너지 수준 부족, 영양 결핍 및 잠재적인 건강 위험이 발생할 수 있습니다. 사용자가 식단 선택을 검토하고 균형 잡힌 식단을 유지하기 위해 권장 칼로리 섭취량을 충족하는 것을 목표로 하는 것이 좋습니다.",
    calorieGoodText:
        "사용자의 칼로리 섭취량이 적정 권장량에 해당합니다. 적절한 양의 칼로리를 섭취함으로써 균형 잡힌 식단을 유지하고 필요한 에너지를 지원하고 있습니다. 특정식이 요구 사항에 대한 권장 범위 내에서 유지되도록 칼로리 섭취량을 계속 모니터링하는 것이 중요합니다.",
    calorieOverText:
        "사용자의 칼로리 섭취량이 적정 권장량을 초과했습니다. 균형 잡힌 식단을 유지하고 과도한 에너지 섭취를 피하려면 칼로리 섭취에 유의하는 것이 중요합니다. 과도한 칼로리를 섭취하면 체중 증가 및 기타 건강 문제가 발생할 수 있습니다. 사용자가 식단 선택을 검토하고 권장 지침에 맞게 칼로리 섭취량을 조정하는 것을 고려하는 것이 좋습니다.",
    saltLackText:
        "사용자의 나트륨 섭취량이 적정 권장량 미만입니다. 나트륨 섭취를 줄이는 것이 전반적인 건강에 도움이 되지만 적절하고 균형 잡힌 접근을 보장하는 것이 중요합니다. 극도로 낮은 나트륨 소비는 전해질 불균형 및 기타 건강 문제로 이어질 수 있습니다. 사용자는 개인의 건강 상태 및 요구 사항을 고려하여 권장 범위 내에서 적당한 양의 나트륨을 섭취하는 데 중점을 두어야 합니다.",
    saltGoodText:
        "사용자의 나트륨 섭취량이 적정 권장량에 해당합니다. 나트륨 섭취를 억제함으로써 전반적인 심장 건강을 증진하고 균형 잡힌 나트륨 수치를 유지하고 있습니다. 과도한 나트륨 섭취는 고혈압과 같은 잠재적인 건강 위험으로 이어질 수 있으므로 칭찬할 만합니다. 사용자는 계속해서 나트륨 섭취에 유의하고 건강한 라이프스타일을 유지하기 위해 정보에 입각한 선택을 해야 합니다.",
    saltOverText:
        "사용자의 나트륨 섭취량이 적정 권장량을 초과했습니다. 높은 나트륨 섭취는 고혈압 및 심장병 위험 증가와 같은 건강 문제에 기여할 수 있습니다. 사용자가 식품 선택 시 나트륨 함량을 인식하고 나트륨 섭취를 줄이기 위해 노력하는 것이 중요합니다. 저나트륨 대체 식품을 선택하고 고도로 가공된 식품을 피하면 나트륨 수치를 관리하는 데 도움이 될 수 있습니다.",
    proteinLackText:
        "사용자의 단백질 섭취량이 적정 권장량 미만입니다. 단백질은 근육 유지, 조직 복구 및 전반적인 신체 기능에 중요한 역할을 하는 필수 영양소입니다. 부적절한 단백질 섭취는 근육 손실, 면역 기능 약화 및 기타 건강 문제로 이어질 수 있습니다. 사용자는 권장 단백질 섭취량을 충족하기 위해 살코기, 가금류, 생선, 콩류 및 유제품과 같은 단백질이 풍부한 식품을 포함하는 데 집중해야 합니다.",
    proteinGoodText:
        "사용자의 단백질 섭취량이 적정 권장량에 해당합니다. 적절한 단백질 섭취는 근육 성장, 조직 복구 및 전반적인 신체 기능에 필수적입니다. 단백질 요구 사항을 충족함으로써 신체가 최적의 건강을 위해 필요한 구성 요소를 받도록 합니다. 그러나 단백질 요구량을 평가할 때 활동 수준 및 개인 목표와 같은 개별 요인을 고려하는 것이 중요합니다.",
    proteinOverText:
        "사용자의 단백질 섭취량이 적정 권장량을 초과했습니다. 단백질은 중요한 다량 영양소이지만 과도한 단백질 섭취는 추가적인 이점을 제공하지 못하고 신장에 부담을 줄 수 있습니다. 사용자가 단백질 섭취의 균형을 유지하고 활동 수준 및 피트니스 목표와 같은 특정 요구 사항에 맞추는 것이 중요합니다. 의료 전문가 또는 등록된 영양사와 상담하면 단백질 요구 사항에 대한 개인화된 지침을 제공할 수 있습니다",
    fatLackText:
        "사용자의 지방 섭취량이 적정 권장량 미만입니다. 건강에 해로운 포화 지방과 트랜스 지방을 줄이는 것이 유익하지만 식단에 적절한 양의 건강한 지방을 포함시키는 것이 중요합니다. 아보카도, 견과류, 올리브 오일에서 발견되는 건강한 지방은 필수 영양소를 제공하고 다양한 신체 기능을 지원합니다. 사용자는 균형 잡힌 지방 섭취를 달성하기 위해 더 건강한 지방 공급원을 식단에 통합하는 것을 고려해야 합니다.",
    fatGoodText:
        "사용자의 지방 섭취량이 적정 권장량에 해당합니다. 균형 잡힌 지방 섭취를 유지함으로써 전반적인 영양 요구를 지원하고 있습니다. 다양한 유형의 지방이 건강에 다양한 영향을 미치며 불포화 지방과 같은 더 건강한 지방을 식단에 통합하면 영양 프로필을 더욱 향상시킬 수 있다는 점에 유의하는 것이 중요합니다. 사용자는 섭취하는 지방의 종류와 양에 대해 의식적인 선택을 계속해야 합니다.",
    fatOverText:
        "사용자의 지방 섭취량이 적정 권장량을 초과했습니다. 일부 지방은 균형 잡힌 식단에 필수적이지만 과도한 지방 섭취는 체중 증가 및 기타 건강 문제로 이어질 수 있습니다. 사용자가 지방 공급원을 검토하고 아보카도, 견과류 및 올리브 오일과 같은 식품에서 발견되는 불포화 지방과 같은 더 건강한 지방의 우선 순위를 지정하는 것이 좋습니다. 지방 소비와 관련하여 적당량과 부분 조절이 핵심입니다.",
};

export default textData;
